package org.example.lesson_11.home_work_11.task_2;
/*
Создайте какой-нибудь класс и сделайте в нем приватный метод, который будет что-нибудь печатать на экран.
В другом классе с методом main() при помощи рефлексии вызовите этот приватный метод.
 */
public class SecretClass {

    private void print() {
        System.out.println("Ballalalal");
    }
}
